intersectSurfacesBetweenPoints(Surface!System.Runtime.CompilerServices.IsConst*,Surface!System.Runtime.CompilerServices.IsConst*,EdgePnt!System.Runtime.CompilerServices.IsConst*,System.Double!System.Runtime.CompilerServices.IsConst(*)[N2],EdgePnt!System.Runtime.CompilerServices.IsConst*,TessEpsCntrl!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,Arr&lt;EdgePnt&gt;*,System.Boolean*,Owner&lt;GCurve&gt;*)
Determine the portion of the intersection curve of two surfaces that lies between
two given points on the intersection curve and, optionally, a start direction
for the intersection curve (which may be approximate).
Side [0] of the EdgePnts refers to pSurface0 and side [1] refers to pSurface1.
The input argument epsCntrl determines a model space tolerance used in determining
whether an intersection curve passes through the start and end points.
pIs3DArc (optional output) is set to true if the intersection curve is known to be a
3D arc (a value of false means it may or may not be a 3D arc).
Optional output poIntCurve is a bounded curve representing the intersection.